---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CwpAddGridPrefix
source: html/e40429ee-74d7-3c56-d34d-f2e1f8d89d4f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CwpAddGridPrefix Property

"Add prefix to Grid Name"

## Syntax (C#)
```csharp
public static ForgeTypeId CwpAddGridPrefix { get; }
```